<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Basic-operations-with-dataframes" data-toc-modified-id="Basic-operations-with-dataframes-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Basic operations with dataframes</a></span><ul class="toc-item"><li><span><a href="#Select:-column" data-toc-modified-id="Select:-column-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Select: column</a></span></li><li><span><a href="#Select:-subset" data-toc-modified-id="Select:-subset-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Select: subset</a></span></li><li><span><a href="#Get-the-unique-values-​​of-a-column" data-toc-modified-id="Get-the-unique-values-​​of-a-column-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Get the unique values ​​of a column</a></span></li></ul></li><li><span><a href="#Filtering" data-toc-modified-id="Filtering-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Filtering</a></span><ul class="toc-item"><li><span><a href="#by-the-value-of-the-columns" data-toc-modified-id="by-the-value-of-the-columns-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>by the value of the columns</a></span></li><li><span><a href="#df.loc-&amp;-df.iloc" data-toc-modified-id="df.loc-&amp;-df.iloc-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>df.loc &amp; df.iloc</a></span><ul class="toc-item"><li><span><a href="#Based-on-label:-loc" data-toc-modified-id="Based-on-label:-loc-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>Based on label: <code>loc</code></a></span></li><li><span><a href="#Based-on-index:--iloc" data-toc-modified-id="Based-on-index:--iloc-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>Based on index:  <code>iloc</code></a></span></li></ul></li><li><span><a href="#Rename-columns" data-toc-modified-id="Rename-columns-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Rename columns</a></span><ul class="toc-item"><li><span><a href="#Rename-columns" data-toc-modified-id="Rename-columns-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Rename columns</a></span></li></ul></li><li><span><a href="#Change-the-data-type-of-a-column" data-toc-modified-id="Change-the-data-type-of-a-column-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Change the data type of a column</a></span></li><li><span><a href="#Copy-a-dataframe" data-toc-modified-id="Copy-a-dataframe-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Copy a dataframe</a></span></li></ul></li><li><span><a href="#deleting" data-toc-modified-id="deleting-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>deleting</a></span><ul class="toc-item"><li><span><a href="#delete-columns" data-toc-modified-id="delete-columns-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>delete columns</a></span></li><li><span><a href="#delete-rows" data-toc-modified-id="delete-rows-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>delete rows</a></span></li></ul></li><li><span><a href="#working-with-the-index" data-toc-modified-id="working-with-the-index-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>working with the index</a></span></li><li><span><a href="#Operations-between-columns" data-toc-modified-id="Operations-between-columns-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Operations between columns</a></span><ul class="toc-item"><li><span><a href="#creating-columns" data-toc-modified-id="creating-columns-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>creating columns</a></span></li><li><span><a href="#apply:-mapping-a-function-to-columns-/-rows" data-toc-modified-id="apply:-mapping-a-function-to-columns-/-rows-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>apply: mapping a function to columns / rows</a></span></li></ul></li><li><span><a href="#Deleting-the-duplicates" data-toc-modified-id="Deleting-the-duplicates-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Deleting the duplicates</a></span></li><li><span><a href="#Null-values" data-toc-modified-id="Null-values-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Null values</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#It-is-null?" data-toc-modified-id="It-is-null?-7.0.1"><span class="toc-item-num">7.0.1&nbsp;&nbsp;</span>It is null?</a></span></li><li><span><a href="#Is-NOT-null?" data-toc-modified-id="Is-NOT-null?-7.0.2"><span class="toc-item-num">7.0.2&nbsp;&nbsp;</span>Is NOT null?</a></span></li><li><span><a href="#Sum-the-null-values-​​of-each-column" data-toc-modified-id="Sum-the-null-values-​​of-each-column-7.0.3"><span class="toc-item-num">7.0.3&nbsp;&nbsp;</span>Sum the null values ​​of each column</a></span></li></ul></li><li><span><a href="#delete-null-values" data-toc-modified-id="delete-null-values-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>delete null values</a></span></li><li><span><a href="#How-to-fill-in-the-missing-data" data-toc-modified-id="How-to-fill-in-the-missing-data-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>How to fill in the missing data</a></span></li></ul></li><li><span><a href="#Export-data" data-toc-modified-id="Export-data-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Export data</a></span></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Further materials</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

In [2]:
import pandas as pd
import numpy as np

## Operaciones básicas con DataFrame

In [3]:
df = pd.read_csv('../../../../evolve-data-python\datasets\employees.csv')
df

<>:1: SyntaxWarning: "\d" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\d"? A raw string is also an option.
<>:1: SyntaxWarning: "\d" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\d"? A raw string is also an option.
C:\Users\Oscar\AppData\Local\Temp\ipykernel_14824\1153612995.py:1: SyntaxWarning: "\d" is an invalid escape sequence. Such sequences will not work in the future. Did you mean "\\d"? A raw string is also an option.
  df = pd.read_csv('../../../../evolve-data-python\datasets\employees.csv')

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061,...,3,80,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062,...,1,80,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064,...,2,80,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065,...,4,80,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068,...,1,80,0,6,3,4,4,3,1,2

In [6]:
 df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

### Seleccionar: columna

In [ ]:
df['Attrition']

### Seleccionar: subconjunto

In [12]:
df[['Attrition','MaritalStatus']]

     Attrition MaritalStatus
0          Yes        Single
1           No       Married
2          Yes        Single
3           No       Married
4           No       Married
...        ...           ...
1465        No       Married
1466        No       Married
1467        No       Married
1468        No       Married
1469        No       Married

[1470 rows x 2 columns]

### Obtener los valores únicos de una columna

In [15]:
df.Age.unique()

array([41, 49, 37, 33, 27, 32, 59, 30, 38, 36, 35, 29, 31, 34, 28, 22, 53,
       24, 21, 42, 44, 46, 39, 43, 50, 26, 48, 55, 45, 56, 23, 51, 40, 54,
       58, 20, 25, 19, 57, 52, 47, 18, 60])

`df.column.unique()`

In [21]:
df.Age.value_counts().sort_index()

Age
18     8
19     9
20    11
21    13
22    16
23    14
24    26
25    26
26    39
27    48
28    48
29    68
30    60
31    69
32    61
33    58
34    77
35    78
36    69
37    50
38    58
39    42
40    57
41    40
42    46
43    32
44    33
45    41
46    33
47    24
48    19
49    24
50    30
51    19
52    18
53    19
54    18
55    22
56    14
57     4
58    14
59    10
60     5
Name: count, dtype: int64

`df.column.value_counts()`

## Filtrado

### por el valor de las columnas

`cuidado con el símbolo |`

### df.loc y df.iloc

`df.iloc[filas, columnas]`

#### Basado en la etiqueta: `loc`

El método loc se puede utilizar de dos maneras diferentes: seleccionar filas o columnas según una etiqueta, o seleccionar filas o columnas según una condición.

In [22]:
df.loc[0:4]

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [23]:
df.iloc[0:4]

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0

#### Basado en el índice: `iloc`

El método iloc se utiliza en DataFrames para seleccionar elementos en función de su ubicación. Su sintaxis es data.iloc[<filas>, <columnas>], donde <filas> y <columnas> son la posición de las filas y columnas que se quieren seleccionar en el orden en el que aparecen en el objeto. Una notación familiar para los usuarios de Matlab. En un DataFrame, cada una de las filas tiene un número que va desde 0 hasta el número total de filas menos uno. Siendo iloc el método que permite seleccionar los datos en función de estos números. Lo mismo aplica para las columnas.

En iloc hay dos argumentos filas y columnas. En caso de omitir el segundo, se seleccionarán todas las columnas de la fila. Por lo que para seleccionar diferentes filas se pueden utilizar.

Sintaxis loc con múltiples condiciones
```python
df.loc[(df["column"] condition) & (df["column"] condition)]
````

### Cambiar el nombre de las columnas

In [26]:
df.rename(columns={'Age':'edad',
                   'Department':'area'},inplace=True)
df

,edad,Attrition,BusinessTravel,DailyRate,area,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061,...,3,80,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062,...,1,80,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064,...,2,80,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065,...,4,80,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068,...,1,80,0,6,3,4,4,3,1,2

#### Cambiar el nombre de las columnas

`.rename(dict_)`

In [28]:
df.rename(columns=str.lower, inplace=True)
df

,edad,attrition,businesstravel,dailyrate,area,distancefromhome,education,educationfield,employeecount,employeenumber,...,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061,...,3,80,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062,...,1,80,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064,...,2,80,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065,...,4,80,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068,...,1,80,0,6,3,4,4,3,1,2

El método de cambio de nombre me permite cambiar el nombre solo de las columnas que quiero, las que están en el diccionario. No es necesario cambiar el nombre de todas a la vez.

In [ ]:
nuevos_nombres = ['business_travel','daily_rate']

`sobrescribir atributos`: requiere una lista con el mismo número de columnas

### Cambiar el tipo de datos de una columna

### Copiar un DataFrame

## Deleting

### Eliminar columnas

### Eliminar filas

También se pueden eliminar filas. Tenga en cuenta que los índices no se restablecen. El índice está asociado con la fila, no con el orden.
¿Se puede reiniciar el índice? Correcto

## trabajando con el índice

Leemos la [documentación](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) para comprender algunos parámetros

`establecer_índice`

`restablecer_índice`

## Operaciones entre columnas

### creando columnas

`como resultado de una operación entre otras columnas`

### `apply`: mapear una función a columnas/filas

`aplicar a una pd.Series`

In [ ]:
df = pd.DataFrame({

    "Name": ["Ana", "Luis", "María"],

"Salary": [50000, 60000, 55000],

"Bonus": [5000, 7000, 6000]

})
df

    Name  Salary  Bonus
0    Ana   50000   5000
1   Luis   60000   7000
2  María   55000   6000

In [66]:
df['sala_total'] = df['Salary'] + df['Bonus']
df

    Name  Salary  Bonus  sala_total
0    Ana   50000   5000       55000
1   Luis   60000   7000       67000
2  María   55000   6000       61000

Aplica una función a lo largo de un eje del DataFrame.
[Lea la documentación](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

In [67]:
df['Salary_k'] = df['Salary'].apply(lambda x: x/1000)
df

    Name  Salary  Bonus  sala_total  Salary_k
0    Ana   50000   5000       55000      50.0
1   Luis   60000   7000       67000      60.0
2  María   55000   6000       61000      55.0

In [69]:
df['Salary_g'] = df.apply(lambda row: row['Salary'] + row['Bonus'], axis=1)
df

    Name  Salary  Bonus  sala_total  Salary_k  Salary_g
0    Ana   50000   5000       55000      50.0     55000
1   Luis   60000   7000       67000      60.0     67000
2  María   55000   6000       61000      55.0     61000

In [ ]:
df_num

Cuando hago un apply sobre una columna, aunque uso un lambda, no pongo axis porque en el caso de abajo lo que estoy haciendo es modificar una columna, uso lambda para decirle al apply que el primer argumento es un string que viene de afuera y el segundo argumento es el propio registro del dataframe.

`aplicar a un df`: vigilar el eje arg

`Lambda y función definida`

`pasa dos argumentos`: uno de la columna, otro mío

## Eliminar los duplicados

[Lea la documentación](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.duplicated.html)

In [78]:
df = pd.read_csv(r'../../../../evolve-data-python\datasets\business.csv')
df

,Customer_ID!!,Purchase_Date###,Product category,Amount_Paid_($)@@,Discount applied@@,COUNTRY!!,City###,CUSTOMER REVIEW
0,100a,21-09-2023,Electronics,NaN,True,Germany,Toronto,Excellent product!
1,NaN,NaN,NaN,NaN,True,Spain,Rome,Customer service was awful.
2,NaN,2023/06/18,Clothing,NaN,True,Mexico,Paris,Worst purchase ever.
3,103a,26-11-2023,Home,$200,Yes,Germany,Los Angeles,Customer service was awful.
4,104a,2023/11/16,Clothing,NaN,False,USA,Toronto,Customer service was awful.
...,...,...,...,...,...,...,...,...
995,NaN,20-05-2023,Clothing,NaN,Yes,Canada,Berlin,"Meh, it's okay."
996,596,19-03-2023,NaN,NaN,False,USA,Madrid,Worst purchase ever.
997,597a,2023/09/17,Home,$278,Yes,Mexico,NaN,Totally worth it!
998,598a,2023/03/05,NaN,108$,True,Germany,New York,"Arrived late, but good quality."
999,599a,2023/12/16,Electronics,11$,NaN,USA,Madrid,Amazing!

In [79]:
list(df.columns)

['Customer_ID!!',
 'Purchase_Date###',
 ' Product category',
 'Amount_Paid_($)@@',
 'Discount applied@@',
 'COUNTRY!!',
 'City###',
 'CUSTOMER REVIEW  ']

In [83]:
nuevos_nombres = ['customer_id','purchase_date','product_cat','amount_paid','discount','country','city','customer_review']

df.columns = nuevos_nombres
df

,customer_id,purchase_date,product_cat,amount_paid,discount,country,city,customer_review
0,100a,21-09-2023,Electronics,NaN,True,Germany,Toronto,Excellent product!
1,NaN,NaN,NaN,NaN,True,Spain,Rome,Customer service was awful.
2,NaN,2023/06/18,Clothing,NaN,True,Mexico,Paris,Worst purchase ever.
3,103a,26-11-2023,Home,$200,Yes,Germany,Los Angeles,Customer service was awful.
4,104a,2023/11/16,Clothing,NaN,False,USA,Toronto,Customer service was awful.
...,...,...,...,...,...,...,...,...
995,NaN,20-05-2023,Clothing,NaN,Yes,Canada,Berlin,"Meh, it's okay."
996,596,19-03-2023,NaN,NaN,False,USA,Madrid,Worst purchase ever.
997,597a,2023/09/17,Home,$278,Yes,Mexico,NaN,Totally worth it!
998,598a,2023/03/05,NaN,108$,True,Germany,New York,"Arrived late, but good quality."
999,599a,2023/12/16,Electronics,11$,NaN,USA,Madrid,Amazing!

`duplicated()`

In [89]:
df.loc[~(df.product_cat.duplicated())]

,customer_id,purchase_date,product_cat,amount_paid,discount,country,city,customer_review
0,100a,21-09-2023,Electronics,NaN,True,Germany,Toronto,Excellent product!
1,NaN,NaN,NaN,NaN,True,Spain,Rome,Customer service was awful.
2,NaN,2023/06/18,Clothing,NaN,True,Mexico,Paris,Worst purchase ever.
3,103a,26-11-2023,Home,$200,Yes,Germany,Los Angeles,Customer service was awful.

In [90]:
df.loc[(df.product_cat.duplicated())]

,customer_id,purchase_date,product_cat,amount_paid,discount,country,city,customer_review
4,104a,2023/11/16,Clothing,NaN,False,USA,Toronto,Customer service was awful.
5,105a,2023/09/07,Clothing,NaN,False,Italy,NaN,Totally worth it!
6,106a,16-06-2023,Home,NaN,No,Spain,Rome,"Meh, it's okay."
7,NaN,2023-10-30,NaN,206$,NaN,USA,Paris,Would buy again!
8,108,06-10-2023,Electronics,$199,Unknown,Italy,NaN,Totally worth it!
...,...,...,...,...,...,...,...,...
995,NaN,20-05-2023,Clothing,NaN,Yes,Canada,Berlin,"Meh, it's okay."
996,596,19-03-2023,NaN,NaN,False,USA,Madrid,Worst purchase ever.
997,597a,2023/09/17,Home,$278,Yes,Mexico,NaN,Totally worth it!
998,598a,2023/03/05,NaN,108$,True,Germany,New York,"Arrived late, but good quality."
999,599a,2023/12/16,Electronics,11$,NaN,USA,Madrid,Amazing!

`drop_duplicates()`

`keep`: Falso, primero/último

```python
for index, row en df.iterrows():
print(row['T1'], row['T2'],row['T3'])
```

## Valores nulos

#### ¿Es nulo?

`pd.isna()` == `pd.isnull()`

#### ¿NO es nulo?

#### Suma los valores nulos de cada columna

### eliminar valores nulos
Hay varias formas de hacer esto, tenemos en cuenta el parámetro `how` y por supuesto [la documentación](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html).

`Eliminar valores faltantes cuando todos son valores faltantes`

`Eliminar valores faltantes donde haya ALGUNO`

`how`: any

Con "any" (parámetro que viene por defecto así que cuidado de no poner nada) se borran todos los registros en los que haya un NaN en alguna columna

`how`: all

`thresh`: int

### Cómo completar los datos faltantes

`fillna()`

## Exportar datos

`to_csv`

`to_json`

**RECORDATORIO:** `inplace=True` si es para que el método modifique el DF, de lo contrario deberá guardarlo en una nueva variable.

# EJERCICIO 📝

1. **LEA** el conjunto de datos superstore.csv desde la carpeta de conjuntos de datos

In [142]:
# ESTAMOS CON: ejercicio de encapsulación de ayer antes de irnos
    # encapsular función para que genere "reporte" para X cliente
df = pd.read_csv(r'../../../../evolve-data-python\datasets\superstore.csv')
df.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,11/8/17,11/11/17,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2017-152156,11/8/17,11/11/17,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

2. **RENOMBRAR** las columnas: convertirlas en minúsculas Y sustituir los espacios por guiones intermedios. Por ejemplo: `Order ID` -> `order_id`

In [117]:
df.columns = df.columns.str.replace(' ', '_').str.lower()
df.head(2)

,row_id,order_id,order_date,ship_date,ship_mode,customer_id,customer_name,segment,country,city,...,postal_code,region,product_id,category,sub-category,product_name,sales,quantity,discount,profit
0,1,CA-2017-152156,11/8/17,11/11/17,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2017-152156,11/8/17,11/11/17,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

3. **ELIMINAR** la columna `ID de fila`

In [120]:
df = df.loc[:,~(df.columns.str.contains('row_id'))]
df.head(2)

,order_id,order_date,ship_date,ship_mode,customer_id,customer_name,segment,country,city,state,postal_code,region,product_id,category,sub-category,product_name,sales,quantity,discount,profit
0,CA-2017-152156,11/8/17,11/11/17,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,CA-2017-152156,11/8/17,11/11/17,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

4. **FILTRA** el conjunto de datos donde se encuentra el cliente: `Roy Französisch`

In [122]:
df.loc[(df.customer_name == 'Roy Französisch')]

,order_id,order_date,ship_date,ship_mode,customer_id,customer_name,segment,country,city,state,postal_code,region,product_id,category,sub-category,product_name,sales,quantity,discount,profit
404,CA-2018-117933,12/24/18,12/29/18,Standard Class,RF-19840,Roy Französisch,Consumer,United States,New York City,New York,10024.0,East,OFF-AP-10004249,Office Supplies,Appliances,Staple holder,35.910,3,0.0,9.6957
1494,CA-2015-123925,12/17/15,12/19/15,Second Class,RF-19840,Roy Französisch,Consumer,United States,Columbus,Georgia,31907.0,South,OFF-AR-10002952,Office Supplies,Art,Stanley Contemporary Battery Pencil Sharpeners,40.050,3,0.0,11.2140
1862,CA-2015-151078,11/12/15,11/12/15,Same Day,RF-19840,Roy Französisch,Consumer,United States,San Antonio,Texas,78207.0,Central,OFF-ST-10001328,Office Supplies,Storage,"Personal Filing Tote with Lid, Black/Gray",49.632,4,0.2,4.9632
2362,CA-2018-136497,4/16/18,4/20/18,Standard Class,RF-19840,Roy Französisch,Consumer,United States,Columbus,Ohio,43229.0,East,OFF-BI-10001553,Office Supplies,Binders,SpineVue Locking Slant-D Ring Binders by Cardinal,13.710,5,0.7,-10.0540
5576,CA-2017-136686,12/12/17,12/16/17,Standard Class,RF-19840,Roy Französisch,Consumer,United States,Pasadena,California,91104.0,West,FUR-FU-10004864,Furniture,Furnishings,"Howard Miller 14-1/2"" Diameter Chrome Round Wa...",383.640,6,0.0,122.7648
5577,CA-2017-136686,12/12/17,12/16/17,Standard Class,RF-19840,Roy Französisch,Consumer,United States,Pasadena,California,91104.0,West,OFF-AP-10002350,Office Supplies,Appliances,Belkin F9H710-06 7 Outlet SurgeMaster Surge Pr...,56.520,3,0.0,15.8256
7779,CA-2017-139381,4/18/17,4/22/17,Standard Class,RF-19840,Roy Französisch,Consumer,United States,Chesapeake,Virginia,23320.0,South,OFF-AP-10001271,Office Supplies,Appliances,Eureka The Boss Cordless Rechargeable Stick Vac,203.920,4,0.0,55.0584
7780,CA-2017-139381,4/18/17,4/22/17,Standard Class,RF-19840,Roy Französisch,Consumer,United States,Chesapeake,Virginia,23320.0,South,TEC-PH-10004924,Technology,Phones,"SKILCRAFT Telephone Shoulder Rest, 2"" x 6.5"" x...",29.560,4,0.0,7.9812
7924,CA-2017-125843,8/13/17,8/16/17,First Class,RF-19840,Roy Französisch,Consumer,United States,Springfield,Virginia,22153.0,South,OFF-BI-10002309,Office Supplies,Binders,Avery Heavy-Duty EZD Binder With Locking Rings,22.320,4,0.0,10.7136
7925,CA-2017-125843,8/13/17,8/16/17,First Class,RF-19840,Roy Französisch,Consumer,United States,Springfield,Virginia,22153.0,South,OFF-LA-10003923,Office Supplies,Labels,Alphabetical Labels for Top Tab Filing,103.600,7,0.0,51.8000
9875,CA-2016-130855,12/29/16,1/5/17,Standard Class,RF-19840,Roy Französisch,Consumer,United States,New York City,New York,10035.0,East,OFF-SU-10003936,Office Supplies,Supplies,Acme Serrated Blade Letter Opener,6.360,2,0.0,0.0636

5. **CREAR un SUBCONJUNTO** del DataFrame con las columnas: `Modo de envío`, `Segmento`, `País`, `Categoría`, `Ganancias`

In [123]:
list(df.columns)

['order_id',
 'order_date',
 'ship_date',
 'ship_mode',
 'customer_id',
 'customer_name',
 'segment',
 'country',
 'city',
 'state',
 'postal_code',
 'region',
 'product_id',
 'category',
 'sub-category',
 'product_name',
 'sales',
 'quantity',
 'discount',
 'profit']

In [124]:
df_sub = df[['ship_mode','segment','country','category','profit']]
df_sub

           ship_mode    segment        country         category    profit
0       Second Class   Consumer  United States        Furniture   41.9136
1       Second Class   Consumer  United States        Furniture  219.5820
2       Second Class  Corporate  United States  Office Supplies    6.8714
3     Standard Class   Consumer  United States        Furniture -383.0310
4     Standard Class   Consumer  United States  Office Supplies    2.5164
...              ...        ...            ...              ...       ...
9989    Second Class   Consumer  United States        Furniture    4.1028
9990  Standard Class   Consumer  United States        Furniture   15.6332
9991  Standard Class   Consumer  United States       Technology   19.3932
9992  Standard Class   Consumer  United States  Office Supplies   13.3200
9993    Second Class   Consumer  United States  Office Supplies   72.9480

[9994 rows x 5 columns]

6. **CALCULAR** la SUMA de la ganancia: debe ser un print() formateado que diga `Roy Französisch obtuvo una ganancia total de X $`

In [135]:
df.loc[(df.customer_name == 'Roy Französisch')].profit.sum()

np.float64(280.0261)

In [ ]:
prof = df.loc[(df.customer_name == 'Roy Französisch')].profit.sum()
print(f'Roy Französisch obtuvo una ganancia total de {prof}$')

Roy Französisch obtuvo una ganancia total de 280.0261$

7. **DEFINE** (ENCAPSULA) en una FUNCIÓN
- Nombre de la función: profit_per_customer
- Argumentos de la función: name, string. el nombre del cliente por el que se filtrará
- para hacer esto, deberá cambiar la línea donde filtra para cambiar el literal "Roy Französisch" por name
- cámbielo también en la impresión formateada
- La función debe realizar los pasos: 1-8
- incluir la línea: `df_imported = pd.read_csv("customer_example.csv")`
- Retorno de la función: debe devolver `df_imported`

In [ ]:
def get_names(df):
    # 1º. Cargar el dataframe
    df = pd.read_csv(r'../../../../evolve-data-python\datasets\superstore.csv')

    # 2º. Elimina los guiones y todo minúscula
    df.columns = df.columns.str.replace(' ', '_').str.lower()

    # 3º. Extrae una lista con los nombres que existen y ordenalos alfabéticamente
    df.customer_name = df.customer_name.str.lower()
    names = df.customer_name.unique()
    names.sort()

    return names

nombres = get_names(df)
print(nombres)

['aaron bergman' 'aaron hawkins' 'aaron smayling' 'adam bellavance'
 'adam hart' 'adam shillingsburg' 'adrian barton' 'adrian hane'
 'adrian shami' 'aimee bixby' 'alan barnes' 'alan dominguez' 'alan haines'
 'alan hwang' 'alan schoenberger' 'alan shonely' 'alejandro ballentine'
 'alejandro grove' 'alejandro savely' 'aleksandra gannaway' 'alex avila'
 'alex grayson' 'alex russell' 'alice mccarthy' 'allen armold'
 'allen goldenen' 'allen rosenblatt' 'alyssa crouse' 'alyssa tate'
 'amy cox' 'amy hunt' 'andrew allen' 'andrew gjertsen' 'andrew roberts'
 'andy gerbode' 'andy reiter' 'andy yotov' 'anemone ratner' 'angele hood'
 'ann blume' 'ann chong' 'ann steele' 'anna andreadi' 'anna chung'
 'anna gayman' 'anna häberlin' 'anne mcfarland' 'anne pryor'
 'annie thurman' 'annie zypern' 'anthony garverick' 'anthony jacobs'
 'anthony johnson' "anthony o'donnell" 'anthony rawles' 'anthony witt'
 'arianne irving' 'art ferguson' 'art foster' 'arthur gainer'
 'arthur prichep' 'arthur wiediger' 'ashley jarboe' 'astrea jones'
 'barbara fisher' 'barry blumstein' 'barry franz' 'barry französisch'
 'barry gonzalez' 'barry pond' 'barry weirich' 'bart folk' 'bart pistole'
 'bart watters' 'becky castell' 'becky martin' 'becky pak' 'ben ferrer'
 'ben peterman' 'ben wallace' 'benjamin farhat' 'benjamin patterson'
 'benjamin venier' 'berenike kampe' 'beth fritzler' 'beth paige'
 'beth thompson' 'bill donatelli' 'bill eplett' 'bill overfelt'
 'bill shonely' 'bill stewart' 'bill tyler' 'bobby elias' 'bobby odegard'
 'bobby trafton' 'brad eason' 'brad norvell' 'brad thomas'
 'bradley drucker' 'bradley nguyen' 'bradley talbott' 'brenda bowman'
 'brendan dodson' 'brendan murry' 'brendan sweed' 'brian dahlen'
 'brian decherney' 'brian derr' 'brian moss' 'brian stugart'
 'brian thompson' 'brooke gillingham' 'brosina hoffman' 'bruce degenhardt'
 'bruce geld' 'bruce stewart' 'bryan davis' 'bryan mills' 'bryan spruell'
 'candace mcmahon' 'cari sayre' 'cari schnelling' 'carl jackson'
 'carl ludwig' 'carl weiss' 'carlos daly' 'carlos meador' 'carlos soltero'
 'carol adams' 'carol darley' 'carol triggs' 'caroline jumper'
 'cassandra brandow' 'catherine glotzbach' 'cathy armstrong' 'cathy hwang'
 'cathy prescott' 'chad cunningham' 'chad mcguire' 'chad sievert'
 'charles crestani' 'charles mccrossin' 'charles sheldon'
 'charlotte melton' 'chloris kastensmidt' 'chris cortes' 'chris mcafee'
 'chris selesnick' 'christina anderson' 'christina demoss'
 'christina vanderzanden' 'christine abelman' 'christine kargatis'
 'christine phan' 'christine sundaresam' 'christopher conant'
 'christopher martinez' 'christopher schild' 'christy brittain'
 'chuck clark' 'chuck magee' 'chuck sachs' 'cindy chapman'
 'cindy schnelling' 'cindy stewart' 'claire gute' 'claudia bergmann'
 'clay cheatham' 'clay ludtke' 'clay rozendal' 'clytie kelty'
 'corey catlett' 'corey roper' 'corey-lock' 'corinna mitchell'
 'craig carreira' 'craig carroll' 'craig leslie' 'craig molinari'
 'craig reiter' 'craig yedwab' 'cyma kinney' 'cynthia arntzen'
 'cynthia delaney' 'cynthia voltz' 'cyra reiten' 'damala kotsonis'
 'dan campbell' 'dan lawera' 'dan reichenbach' 'dana kaydos' 'daniel byrd'
 'daniel lacy' 'daniel raglin' 'dario medina' 'darren budd'
 'darren koutras' 'darren powers' 'darrin martin' 'darrin sayre'
 'darrin van huff' 'dave brooks' 'dave hallsten' 'dave kipp'
 'dave poirier' 'david bremer' 'david flashing' 'david kendrick'
 'david philippe' 'david smith' 'david wiener' 'dean braden' 'dean katz'
 'dean percer' 'deanra eno' 'deborah brumfield' 'debra catini'
 'deirdre greer' 'delfina latchford' 'denise leinenbach' 'denise monton'
 'dennis bolton' 'dennis kane' 'dennis pardue' 'denny blanton' 'denny joy'
 'denny ordway' 'dianna arnett' 'dianna vittorini' 'dianna wilson'
 'dionis lloyd' 'don jones' 'don miller' 'don weiss' 'dorothy badders'
 'dorothy dickinson' 'dorothy wardle' 'dorris liebe' 'doug bickford'
 'doug jacobs' "doug o'connell" 'duane benoit' 'duane huffman'
 'duane noonan' 'ed braxton' 'ed jacobs' 'ed ludwig' 'edward becker'
 'edward hooks' 'edward nazzal' 'eileen kiefer' 'eleni mccrary'
 'elizabeth moffitt' 'ellis ballard' 'elpida rittenbach' 'emily burns'
 'emily ducich' 'emily grady' 'emily phan' 'eric barreto' 'eric hoffmann'
 'eric murdock' 'erica bern' 'erica hackney' 'erica hernandez'
 'erica smith' 'erin ashbrook' 'erin creighton' 'erin mull' 'erin smith'
 'eudokia martin' 'eugene barchas' 'eugene hildebrand' 'eugene moren'
 'eva jacobs' 'evan bailliet' 'evan henry' 'evan minnotte' 'filia mcadams'
 'frank atkinson' 'frank carlisle' 'frank gastineau' 'frank hawley'
 'frank merwin' 'frank olsen' 'frank preis' 'fred chung' 'fred harton'
 'fred hopkins' 'fred mcmath' 'fred wasserman' 'gary hansen' 'gary hwang'
 'gary mcgarr' 'gary mitchum' 'gary zandusky' 'gene hale' 'gene mcclure'
 'george ashbrook' 'george bell' 'george zrebassa' 'georgia rosenberg'
 'giulietta baptist' 'giulietta dortch' 'giulietta weimer' 'grace kelly'
 'grant thornton' 'greg guthrie' 'greg hansen' 'greg matthias'
 'greg maxwell' 'greg tran' 'guy armstrong' 'guy phonely' 'guy thornton'
 'hallie redmond' 'harold dahlen' 'harold engle' 'harold pawlan'
 'harold ryan' 'harry greene' 'harry marie' 'heather jas'
 'heather kirkland' 'helen abelman' 'helen andreada' 'helen wasserman'
 'henia zydlo' 'henry goldwyn' 'henry macallister' 'herbert flentye'
 'hilary holden' 'hunter glantz' 'hunter lopez' 'ionia mcgrath'
 'irene maddox' 'ivan gibson' 'ivan liston' 'jack garza' 'jack lebron'
 "jack o'briant" 'james galang' 'james lanier' 'jamie frazer'
 'jamie kunitz' 'jane waco' 'janet lee' 'janet martin' 'janet molinari'
 "jas o'carroll" 'jason fortune-' 'jason gross' 'jason klamczynski'
 'jasper cacioppo' 'jay fein' 'jay kimmel' 'jenna caffey'
 'jennifer braxton' 'jennifer ferguson' 'jennifer halladay'
 'jennifer jackson' 'jennifer patt' 'jeremy ellison' 'jeremy farry'
 'jeremy lonsdale' 'jeremy pistek' 'jessica myrick' 'jesus ocampo'
 'jill fjeld' 'jill matthias' 'jill stevenson' 'jim epp' 'jim karlsson'
 'jim kriz' 'jim mitchum' 'jim radford' 'jim sink' 'jocasta rupert'
 'joe elijah' 'joe kamberova' 'joel eaton' 'joel jenkins' 'john castell'
 'john dryer' 'john grady' 'john huston' 'john lee' 'john lucas'
 'john murray' 'john stevenson' 'jonathan doherty' 'jonathan howell'
 'joni blumstein' 'joni sundaresam' 'joni wasserman' 'joseph airdo'
 'joseph holt' 'joy bell-' 'joy daniels' 'joy smith' 'julia barnett'
 'julia dunbar' 'julia west' 'juliana krohn' 'julie creighton'
 'julie kriz' 'julie prescott' 'justin deggeller' 'justin ellison'
 'justin hirsh' 'justin mackendrick' 'justin ritter' 'kalyca meade'
 'karen bern' 'karen carlisle' 'karen daniels' 'karen ferguson'
 'karen seio' 'karl braun' 'katharine harms' 'katherine ducich'
 'katherine hughes' 'katherine murray' 'katherine nockton'
 'katrina bavinger' 'katrina edelman' 'katrina willman' 'kean nguyen'
 'kean takahito' 'kean thornton' 'keith dawkins' 'keith herrera'
 'kelly andreada' 'kelly collister' 'kelly lampkin' 'kelly williams'
 'ken black' 'ken brennan' 'ken dana' 'ken heidel' 'ken lonsdale'
 'khloe miller' 'kimberly carter' 'kristen hastings' 'kristina nunn'
 'kunst miller' 'larry blacks' 'larry hughes' 'larry tron'
 'laura armstrong' 'laurel beltran' 'laurel elliston' 'laurel workman'
 'lauren leatherbury' 'lela donovan' 'lena cacioppo' 'lena creighton'
 'lena hernandez' 'lena radford' 'linda cazamias' 'linda southworth'
 'lindsay castell' 'lindsay shagiari' 'lindsay williams' 'lisa decherney'
 'lisa hazard' 'lisa ryan' 'liz carlisle' 'liz mackendrick'
 'liz pelletier' 'liz preis' 'liz thompson' 'liz willingham'
 'logan currie' 'logan haushalter' 'lori olson' 'luke foster'
 'luke schmidt' 'luke weiss' 'lycoris saunders' 'lynn smith'
 'magdelene morse' 'marc crier' 'marc harrigan' 'maria bertelson'
 'maria etezadi' 'maria zettner' 'maribeth dona' 'maribeth schnelling'
 'maribeth yedwab' 'marina lichtenstein' 'maris laware' 'mark cousins'
 'mark haberlin' 'mark hamilton' 'mark packer' 'mark van huff'
 "mary o'rourke" 'mary zewe' 'marybeth skach' 'mathew reese'
 'matt abelman' 'matt collins' 'matt collister' 'matt connell'
 'matt hagelstein' 'matthew clasen' 'matthew grinstein' 'maureen fritzler'
 'maureen gastineau' 'maureen gnade' 'maurice satty' 'max engle'
 'max jones' 'max ludwig' 'maxwell schwartz' 'maya herman' "meg o'connel"
 'meg tillman' 'melanie seite' 'michael chen' 'michael dominguez'
 'michael grace' 'michael granlund' 'michael kennedy' 'michael moore'
 'michael nguyen' 'michael oakman' 'michael paige' 'michael stewart'
 'michelle arnett' 'michelle ellison' 'michelle huthwaite'
 'michelle lonsdale' 'michelle moray' 'michelle tran' 'mick brown'
 'mick crebagga' 'mick hernandez' 'mike caudle' 'mike gockenbach'
 'mike kennedy' 'mike pelletier' 'mike vittorini' 'mitch gastineau'
 'mitch webber' 'mitch willingham' 'monica federle' 'muhammed lee'
 'muhammed macintyre' 'muhammed yedwab' 'nancy lomonaco' 'naresj patel'
 'nat carroll' 'nat gilpin' 'natalie decherney' 'natalie fritzler'
 'natalie webber' 'nathan cano' 'nathan gelder' 'nathan mautz'
 'neil ducich' 'neil französisch' 'neil knudson' 'neola schneider'
 'neoma murray' 'nick crebassa' 'nick radford' 'nick zandusky'
 'nicole brennan' 'nicole fjeld' 'nicole hansen' 'noah childs'
 'noel staavos' 'nona balk' 'nora paige' 'nora pelletier' 'nora preis'
 'odella nelson' 'olvera toch' 'pamela coakley' 'pamela stobb'
 'parhena norris' 'patricia hirasaki' 'patrick bzostek' 'patrick gardner'
 'patrick jones' "patrick o'brill" "patrick o'donnell" 'patrick ryan'
 'paul gonzalez' 'paul knutson' 'paul lucas' 'paul macintyre' 'paul prost'
 'paul stevenson' 'paul van hugh' 'pauline chand' 'pauline johnson'
 'pauline webber' 'penelope sewall' 'pete armstrong' 'pete kriz'
 'pete takahito' 'peter bühler' 'peter fuller' 'peter mcvee'
 'philip brown' 'philip fox' 'philisse overcash' 'phillina ober'
 'phillip breyer' 'phillip flathmann' 'pierre wener' 'quincy jones'
 'rachel payne' 'ralph arnett' 'ralph kennedy' 'ralph ritter'
 'randy bradley' 'randy ferguson' 'raymond buch' 'raymond messe'
 'resi pölking' 'ricardo emerson' 'ricardo sperren' 'richard bierner'
 'richard eichhorn' 'rick bensley' 'rick duston' 'rick hansen'
 'rick huthwaite' 'rick reed' 'rick wilson' 'ritsa hightower'
 'rob beeghly' 'rob dowd' 'rob haberlin' 'rob lucas' 'rob williams'
 'robert barroso' 'robert dilbeck' 'robert marley' 'robert waldorf'
 'roger barcio' 'roger demir' 'roland fjeld' 'roland murray'
 'roland schwarz' "rose o'brian" 'ross baird' 'ross devincentis'
 'roy collins' 'roy französisch' 'roy phan' 'roy skaria' 'ruben ausman'
 'ruben dartt' 'russell applegate' "russell d'ascenzo" 'ryan akin'
 'ryan crowe' 'sally hughsby' 'sally knutson' 'sally matthias'
 'sam craven' 'sam zeldin' 'sample company a' 'sandra flanagan'
 'sandra glassco' 'sanjit chand' 'sanjit engle' 'sanjit jacobs'
 'saphhira shifley' 'sara luxemburg' 'sarah bern' 'sarah brown'
 'sarah foster' 'sarah jordon' 'scot coram' 'scot wooten' 'scott cohen'
 'scott williamson' 'sean braxton' 'sean christensen' 'sean miller'
 "sean o'donnell" 'sean wendt' 'seth vernon' 'shahid collister'
 'shahid hopkins' 'shahid shariari' 'sharelle roach' 'shaun chance'
 'shaun weien' 'sheri gordon' 'shirley daniels' 'shirley jackson'
 'shirley schmidt' 'shui tom' 'sibella parks' 'skye norling'
 'sonia cooley' 'sonia sunley' 'speros goranitis' 'stefania perrino'
 'stefanie holloman' 'stephanie phelps' 'stephanie ulpright'
 'steve carroll' 'steve chapman' 'steve nguyen' 'steven cartwright'
 'steven roelle' 'steven ward' 'stewart carmichael' 'stewart visinsky'
 'stuart calhoun' 'stuart van' 'sue ann reed' 'sung chung' 'sung pak'
 'sung shariari' 'susan gilcrest' 'susan mackendrick' 'susan pistek'
 'susan vittorini' 'suzanne mcnair' 'sylvia foulston' 'tamara chand'
 'tamara dahlen' 'tamara manning' 'tamara willingham' 'tanja norvell'
 'ted butterfield' 'ted trevino' 'thais sissman' 'thea hendricks'
 'thea hudgings' 'theone pippenger' 'theresa coyne' 'theresa swint'
 'thomas boland' 'thomas brumley' 'thomas seio' 'thomas thornton'
 'tiffany house' 'tim brockman' 'tim taslimi' 'toby braunhardt'
 'toby carlisle' 'toby gnade' 'toby ritter' 'toby swindell' 'todd boyes'
 'todd sumrall' 'tom ashbrook' 'tom boeckenhauer' 'tom prescott'
 'tom stivers' 'tonja turnell' 'tony chapman' 'tony molinari' 'tony sayre'
 'tracy blumstein' 'tracy collins' 'tracy hopkins' 'tracy poddar'
 'tracy zic' 'troy blackwell' 'troy staebel' 'trudy brown' 'trudy glocke'
 'trudy schmidt' 'valerie dominguez' 'valerie mitchum' 'valerie takahito'
 'vicky freymann' 'victor preis' 'victoria brennan' 'victoria pisteka'
 'victoria wilson' 'vivek gonzalez' 'vivek grady' 'vivek sundaresam'
 'vivian mathis' 'william brown' 'xylona preis' 'yana sorensen'
 'yoseph carroll' 'zuschuss carroll' 'zuschuss donatelli']

In [302]:
def profit_per_customer(name_input):
    # 1º. Cargar el dataframe
    df = pd.read_csv(r'../../../../evolve-data-python\datasets\superstore.csv')

    # 2º. Elimina los guiones y todo minúscula
    df.columns = df.columns.str.replace(' ', '_').str.lower()

    # 3º. Elimina columna
    df = df.drop(columns=['row_id'])

    # 4º Estandarizar la columna 'customer_name' y el input
    name = name_input.lower()
    df['customer_name'] = df['customer_name'].str.lower()
    #df.customer_name = df.customer_name.str.lower()

    # 5º Calcular la ganancia total para el cliente
    if name not in df['customer_name'].unique():
        return 'Probablemente el nombre no conste en la tabla o esté mal escrito'
    
    else:
        prof = df.loc[(df.customer_name == name)].profit.sum()
        
    return f'{name_input} obtuvo un resultado total de {prof:.2f}$'


# Input de la barra de arriba
name_input = input('Nombre a buscar: ')

# Resultado de la función
resultado = profit_per_customer(name_input)
print(resultado)

Zuschuss Donatelli obtuvo un resultado total de 249.13$

8. **LLAMADA**: `df_claire = beneficio_per_cliente("Roy Französisch")`

9. **Reutiliza tu propia función**: ¿cuánto ganó «Erica Smith»? Asegúrate de guardarla en una variable llamada «df_erica_smith»

10. **EXPORTAR** el csv con el nombre: `customer_example.csv`

## Métodos habituales de Pandas
```python
df.head() # imprime la cabecera, por defecto 5 filas
df.tail() # establece la cola, por defecto 5 filas
df.describe() # descripción estadística
df.info() # información del df
df.columns # muestra la columna
df.index # muestra el índice
df.dtypes # muestra los tipos de datos de la columna
df.plot() # hace un gráfico
df.hist() # hace un histograma
df.col.value_counts() # cuenta los valores únicos de una columna
df.col.unique() # devuelve valores únicos de una columna
df.copy() # copia el df
df.drop() # elimina columnas o filas (axis=0,1)
df.dropna() # elimina nulos
df.fillna() # rellena nulos
df.shape # dimensiones del df
df._get_numeric_data() # selecciona numérico columnas
df.rename() # renombrar columnas
df.str.replace() # reemplazar columnas de cadenas
df.astype(dtype='float32') # cambiar el tipo de datos
df.iloc[] # localizar por índice
df.loc[] # localizar por elemento
df.transpose() # transpone el df
df.T
df.sample(n, frac) # muestra de df
df.col.sum() # suma de una columna
df.col.max() # máximo de una columna
df.col.min() # mínimo de una columna
df[col] # seleccionar columna
df.col
df.isnull() # valores nulos
df.isna()
df.notna() # valores no nulos
df.drop_duplicates() # eliminar duplicados
df.reset_index(inplace=True) # restablecer el índice y sobrescribir
```
## Materiales adicionales

* [Lea el docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Hoja de trucos](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Ejercicios para practicar](https://github.com/guipsamora/pandas_exercises)
* [Más sobre merge, concat y join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). ¡Y [aún más!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)
* [Categorías en df](https://runebook.dev/en/docs/pandas/user_guide/categorical)